cf/Documents/SettlementsReconciliation.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Document>
		<Properties>
			<Name>SettlementsReconciliation</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Counterparty</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BeginOfPeriod</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EndOfPeriod</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Status</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SettlementsReconciliationStatuses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Responsible</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CounterpartyRepresentative</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ContactPersons</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentCurrency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DescriptionContractsSelection</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SortByContracts</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BalanceBeginPeriod</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteCounterpartyRepresentativePosition</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ContactPersonsRoles</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DeleteContract</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CounterpartyContracts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DocumentDescription</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AddCompanyInDocumentPresentation</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>CompanyData</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>DocumentDate</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DocumentNumber</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AccountingDocument</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CustomerInvoice</v8:Type>
								<v8:Type>cfg:DocumentRef.AgentReport</v8:Type>
								<v8:Type>cfg:DocumentRef.SupplierInvoice</v8:Type>
								<v8:Type>cfg:DocumentRef.AcceptanceCertificate</v8:Type>
								<v8:Type>cfg:DocumentRef.PaymentExpense</v8:Type>
								<v8:Type>cfg:DocumentRef.ProcessingReport</v8:Type>
								<v8:Type>cfg:DocumentRef.OtherExpenses</v8:Type>
								<v8:Type>cfg:DocumentRef.ExpenseReport</v8:Type>
								<v8:Type>cfg:DocumentRef.CashReceipt</v8:Type>
								<v8:Type>cfg:DocumentRef.CustomerOrder</v8:Type>
								<v8:Type>cfg:DocumentRef.ProductionOrder</v8:Type>
								<v8:Type>cfg:DocumentRef.SubcontractorReport</v8:Type>
								<v8:Type>cfg:DocumentRef.ReportToPrincipal</v8:Type>
								<v8:Type>cfg:DocumentRef.CashPayment</v8:Type>
								<v8:Type>cfg:DocumentRef.Netting</v8:Type>
								<v8:Type>cfg:DocumentRef.PaymentReceipt</v8:Type>
								<v8:Type>cfg:DocumentRef.EnterOpeningBalance</v8:Type>
								<v8:Type>cfg:DocumentRef.AdditionalCosts</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DocumentDescription</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ContractCurrency</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CompanyDebtAmount</Name>
							<Comment>Company's debt according to company data</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ClientDebtAmount</Name>
							<Comment>Counterparty debt by counterparty data</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Contract</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CounterpartyContracts</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>CounterpartyData</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IncomingDocumentDate</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IncomingDocumentNumber</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AccountingDocument</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CustomerInvoice</v8:Type>
								<v8:Type>cfg:DocumentRef.AgentReport</v8:Type>
								<v8:Type>cfg:DocumentRef.SupplierInvoice</v8:Type>
								<v8:Type>cfg:DocumentRef.AcceptanceCertificate</v8:Type>
								<v8:Type>cfg:DocumentRef.PaymentExpense</v8:Type>
								<v8:Type>cfg:DocumentRef.ProcessingReport</v8:Type>
								<v8:Type>cfg:DocumentRef.OtherExpenses</v8:Type>
								<v8:Type>cfg:DocumentRef.ExpenseReport</v8:Type>
								<v8:Type>cfg:DocumentRef.CashReceipt</v8:Type>
								<v8:Type>cfg:DocumentRef.CustomerOrder</v8:Type>
								<v8:Type>cfg:DocumentRef.ProductionOrder</v8:Type>
								<v8:Type>cfg:DocumentRef.SubcontractorReport</v8:Type>
								<v8:Type>cfg:DocumentRef.ReportToPrincipal</v8:Type>
								<v8:Type>cfg:DocumentRef.CashPayment</v8:Type>
								<v8:Type>cfg:DocumentRef.Netting</v8:Type>
								<v8:Type>cfg:DocumentRef.PaymentReceipt</v8:Type>
								<v8:Type>cfg:DocumentRef.EnterOpeningBalance</v8:Type>
								<v8:Type>cfg:DocumentRef.AdditionalCosts</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DocumentDescription</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DocumentCurrency</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CompanyDebtAmount</Name>
							<Comment>Counterparty debt by counterparty data</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ClientDebtAmount</Name>
							<Comment>Company's debt according to counterparty data</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Contract</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CounterpartyContracts</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>DeleteEnteredCorrections</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>CorrectionDocument</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Netting</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DebtDelta</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CreditDelta</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>CounterpartyContracts</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Select</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Contract</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CounterpartyContracts</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Enums/SettlementsReconciliationStatuses.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>SettlementsReconciliationStatuses</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Created</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OnChecking</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Verified</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Documents/SettlementsReconciliation/Ext/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

////////////////////////////////////////////////////////////////////////////////
// PROCEDURES AND FUNCTIONS TO INITIALIZE AND FILL THE DOCUMENT

// Initializes the settlement reconciliation act
//
Procedure InitializeDocument() Export
	
	If Not ValueIsFilled(Responsible) Then
		Responsible = Users.CurrentUser();
	EndIf;
	
	If Not ValueIsFilled(Status) Then
		Status = Enums.SettlementsReconciliationStatuses.Created;
	EndIf;
	
	If Not ValueIsFilled(EndOfPeriod) Then
		EndOfPeriod = CurrentDate();
	EndIf;

EndProcedure // InitializeDocument()

// Fills a document header according to the structure passed from the assistant
//
// Parameters:
// FillingData - Structure
//
Procedure FillDocumentByAssistantData(FillingData)
	
	FillPropertyValues(ThisObject, FillingData);
	
	FillingData.Insert("Date", Date);
	
EndProcedure // FillDocumentByAssistantData()

///////////////////////////////////////////////////////////////////////////////////////////////////
// PROCEDURE - EVENT HANDLERS.

// Procedure - event handler "OnCopy".
//
Procedure OnCopy(CopiedObject)
	
	// Clear the document tabular section.
	If CounterpartyData.Count() > 0 Then
		CounterpartyData.Clear();
	EndIf;
	
EndProcedure // OnCopy()

// Procedure - event handler "FillingProcessor".
//
Procedure Filling(FillingData, StandardProcessing)
	
	If TypeOf(FillingData) = Type("Structure") Then
		FillDocumentByAssistantData(FillingData);
	EndIf;
	
	InitializeDocument();
	
EndProcedure // FillingProcessor()

#EndIf
